Revit 2024 API
ParameterUtils.GetBuiltInParameterGroup Method
 Gets the BuiltInParameterGroup value corresponding to built-in parameter group identified by the given ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")]
public static BuiltInParameterGroup GetBuiltInParameterGroup(
	ForgeTypeId groupTypeId
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")> _
Public Shared Function GetBuiltInParameterGroup ( _
	groupTypeId As ForgeTypeId _
) As BuiltInParameterGroup
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")]
public:
static BuiltInParameterGroup GetBuiltInParameterGroup(
	ForgeTypeId^ groupTypeId
)
Parameters
groupTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
The parameter group identifier.
Return Value
The BuiltInParameterGroup value corresponding to the given parameter group identifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  groupTypeId is not a built-in parameter group identifier. See IsBuiltInParameterGroup(ForgeTypeId) and GetParameterGroupTypeId(BuiltInParameter).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace